// [Wednesday 2:39 PM] Maral Jargalsaikhan
// Operations (part 1)
// 1. 4 нь 3-аас их үү ?
// 2. 3 нь 4-өөс их үү ?
// 3. 4 нь 3-аас их буюу тэнцүү юу ?
// 4. 3 нь 4-өөс их буюу тэнцүү юу ?
// 5. 4 нь 4-тэй тэнцүү юу ?
// 6. 4 нь 4-тэй яг тэнцүү юу ?
// 7. 4 нь 4-тэй тэнцүү биш нь үнэн үү ?
// 8. 4 нь "4"-тэй тэнцүү биш үү ?
// 9. 4 нь "4"-тэй яг тэнцүү юу ?
// 10. 4 нь "4"-тэй тэнцүү юу ?
// 11. 4 нь 3-аас их болон 10 нь 12-оос бага нь үнэн үү ?
// 12. 4 нь 3-аас их болон 10 нь 12-оос их нь үнэн үү ?
// 13. 4 нь 3-аас их эсвэл 10 нь 12-оос бага нь үнэн үү ?
// 14. 4 нь 3-аас их эсвэл 10 нь 12-оос их нь үнэн үү ?
// 15. 4 нь 3-аас бага эсвэл 10 нь 12-оос их нь үнэн үү ?
// 16. let five = !(4 > 3) ямар хариу буцаах вэ ?
// 17. let six = !(4 < 3) ямар хариу буцаах вэ ?
// 18. let seven = !(4 > 3 && 10 < 12) ямар хариу буцаах вэ ?
// 19. let eight = !(4 > 3 && 10 > 12) ямар хариу буцаах вэ ?
// 20. let nine = !(4 === "4") ямар хариу буцаах вэ ?

let a = 4;
let b = 3;
let x = 10;
let y = 12;
console.log(a > b && x < y);
console.log(a > b && x > y);
console.log(a > b || x < y);
console.log(a > b || x > y);
console.log(a < b || x > y);
let five = !(4 > 3);
console.log(five);
let six = !(4 > 3);
console.log(six);
let seven = !(4 > 3 && 10 < 12);
console.log(seven);
let eight = !(4 > 3 && 10 > 12);
console.log(eight);
let nine = !(4 === "4");
console.log(nine);
